print(5 + 3)   # 8
print(10 + 20) # 30
print(1 + 9)   # 10

# გამოკლება (-)
print(10 - 5)  # 5
print(20 - 7)  # 13
print(15 - 3)  # 12

# გამრავლება (*)
print(4 * 2)   # 8
print(6 * 3)   # 18
print(10 * 5)  # 50

# გაყოფა (/)
print(15 / 3)  # 5.0
print(20 / 4)  # 5.0
print(100 / 20)# 5.0

# მთელ რიცხვზე გაყოფა (//)
print(15 // 10) # 1
print(10 // 7)  # 1
print(40 // 12) # 3

# ნაშთის პოვნა (%)
print(10 % 7)   # 3
print(3 % 2)    # 1
print(50 % 25)  # 0

# ხარისხში აყვანა (**)
print(4 ** 3)   # 64
print(10 ** 3)  # 1000
print(2 ** 6)   # 64


























