
# PYTHON

#1)კომენტარის სახით ჩამოწერეთ რომელი მონაცემთა ტიპები ვისწავლეთ და თთეულს გვერდით მიუწერეთ 1 მაგალითი
#integer - 20
#boolean - სიმართლე და სიცრუე
#string -"გოა"
#float - 20.5



#2)ტერმინალში გამოიტანეთ 1 სტრინგი 1 ინტეჯერი 1 ფლოუთი 1 ბულეანი

print("GOA")
print(13)
print(10.5)
print(True)

#3)შექმენი 4 ცვლადი snake_case ის გამოყენებით,1 ში შეინახე სტრინგი მეორეში ინტეჯერი მესამეში ბულეანი მეოთხეში ფლოუთი,დაპრინტე თითოეული ამთგანი(გამოიყენე ცვლადის სახელები)

# user_number 




#4)შექმენი 2 ცვლადი სადაც შეინახავ ინტეჯერ ტიპის მონაცემებს,თქვენი დავალებაა რომ ამ ორ რიცხვზე მოახდინოთ ყველა მათემატიკური მოქმედება რაც ვისწავლეთ

num1 = 20

num2 = 30

print(num1 / num2) 




#5)შექმენი ორი ცვლადი შეინახე ორივეში სტრინგებიდ და შეკრიბე ეს ორი სტრინგი,ასევე კომენტარის სახით დაწერე რა ეწოდება ამ მოქმედებას(სტრინგების შეერთებას)```

#konkatinacia


num3 = "GOA"

num4 = "BEST"

print( num3 + num4)


#6)კომენტარის სახით ახსენით თითოეული რას აკეთებს და მოიყვანე თითო მაგალით --> % , // , **






#7)მომხმარებელს შემოატანინე ორი რიცხვიდ ა მოახდინე აბსოლიტურად ყველა ამთემატიკური მოქმედება ამ ორ რიცხვზე --> + - * / // ** %

# num5 = int(input("Enter number"))

# num6 = int(input("enter second number"))

# print(num5 // num6)
# print(num5 ** num6)
# print(num5 % num6)





#Bouns
# ქვემოთ მოცემულ მაგალითებს გვერდით მიუწერეთ პასუხები(დააკომენტარეთ ყველა და კომენტარებად გქონდეთ მაგალითები:

#      15 / 3 = 5
#      20 / 4 = 5
#      

#      15 // 10 = 1
#      10 // 7 = 1
#      

#      4 * 3 =  12
#      40 * 3 =  120
#      120 * 3 = 360

#      4 ** 3 = 64
#      10 ** 3 =  1000
#     

#      10 % 7 = 3
#      3 % 2 = 1


#8)კომენტარის სახით ახსენით თთოეული რას აკეთებს --> str() , int() , float(),მოიყვანე თითო მაგალითი სამივე მათგანზე

# hi = "10"

# print(int(hi))

# hello = 13

# print(str(hello))

# hey = 15


# print(float(hey))

#9)შექმენი 4 ცვლადი სადაც შეინახავ განსხვავებული ტიპის მონაცემებს,შენი დავალებაა რომ დაბეჭდო მათი ტიპები,გამოიყენე ნასწავლი ფუნქცია რომელიც იგებდა ფრჩხილებში გადაცემული ელემენტის ტიპს```


# print(type("goga"))


#10)მომხმარებელს შემოატანინე ორი რიცხვი,შენი დავალეაბაა ამ ორ რიცხვზე მოახდინოთ შედარების ოპერაციები(გამოიყენე ყველა შედარების ოპერატორი რაც ვისწავლეთ),

# hey =int(input("enter number"))

# hey1 =int(input("enter second  number"))

# print(hey == hey1)
# print(hey > hey1)
# print(hey < hey1)
# print(hey <= hey1) 
# print(hey >= hey1)



#11)კომენტარის სახით ახსენით რომელი ლოგიკური ოპერატორები ვისწავლეთ და რომლის გამოყენების დროს რა ხდება,მოიყვანე თითო მაგალითი 






#12)გვერდით მიუწერეთ პასუხები წერტილების მაგივრად
#                                
# True and True -- True       |   True or True -- True       
# True and False -- False     |   True or False -- True
# False and True -- False     |   False or True -- True
# False and False -- False    |   False or False -- False

#13)გვერდით მიუწერეთ საბოლოო პასუხი წერტილების მაგივრად
#  5 == 10 and 10 <= 10 -- False  |   True or "giorgi" == "giorgi" True         
# True and False -- False     |   10 < 2 or "lasha" == "beqa" False
# 10 > 3 and 5 == 3 False     |   2 >= 3 or 40 < 2 False
# True and 200 <= 200 True   |   4 == 3 or 50 > 300 Fase


#14)ტერმინალში გამოიტანეთ თქვენი რიცხვები 5 იდან 200 მდე for loop

# for i in range(5,201):
#     print(i)


#15)ტერმინალში გამოიტანეთ რიცვები 100 დან 150 მდე 5 ის სტეპის გამოტოვებით for loop```

# for i in range(100,151,5):
#     print(i)


#16)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ for loop
# for i in range(10):
#     print("Mari")


#17)ტერმინალში გამოიტანეთ თქვენი რიცხვები 10 იდან 50 მდე while loop

# i = 10
# while i <51:
#     print(i)
#     i = i + 1




#18)ტერმინალში გამოიტანეთ რიცვები 50 დან 150 მდე 10 ის სტეპის გამოტოვებით while loop

# i = 50 
# while i <150:
#     print(i)
#     i = i + 10


#19)ტერმინალში გამოიტანეთ თქვენი სახელი 10 ჯერ while loop

# i = 0
# while i <10:
#     print("Mari")
#     i = i + 1



# Lists

#20) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი და for loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი ```


# box =["nana","goga","nuca","ele","petre"]

# for i in range(0,5):
#     print(box[i])


#21) შექმენი ცვლადი სადაც შეინახავ სიას ,ამ სიაში მოათავსე 5 სტრინგ ტიპის მონაცემი დაwhile loop ის დახმარებით გამოიტანე ყველა სიის ელემენტი 
 
# box4 = ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]

# i = 0
# while i < 6:
#     print(box4[i])
#     i +=1

#22)შექმენი სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"],შენი დავალებაა ამ სიიდან გამოიტანო  საბა და იამზე როგორც დადებით ასევე უარყოფითი ინდექსების გამოყენებით

# box2 = ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე"]

# box2 [3] = "ana"

# print(box2)

# print(box2[2])
# print(box2[-4])

#23)შექმენი ცვლადი სადაც შეინახავ სტრინგს --> 'ჰიდროელექტროსადგური" , შენი დავალებაა რომ გამოიტანო მესამე და მერვე ინდექსზე მდგომი ასოები ტერმინალში

# ctr1 = "ჰიდროელექტროსადგური"

# print(ctr1[3])
# print(ctr1[8])


#24)შექმენი ცვლადი სადაც მომხმარებელს შემოატანინებ რიცხვს , შემდეგ --> თუ მომხმარებლის მიერ შემოტანილი რიცცხვი არის 0 ზე მეტი დაუპრინტე -->"more than 0" , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები დაუპრინტე --> "Less than 0",სხვა შემთხვევაშიდ აუპრინტე --> "Equal 0"

# lol =int(input("Enter numbere"))
# if lol >0:
#     print("more then 0")
# elif lol <0:
#     print("less then 0")
# else:
#     print("equal 0")

#25)შექმენი ცვლადი სადაც შეინახავ სტადამიანების სახელებს(6 ცალი) სიას-->შემდეგ შეამოწმეთ --> თუ ამ სიაში მესამე ინდექსზე მდგომი ელემენტი არის "lasha" -->დაუპრინტე --> "You choose lasha" , თუ სიაში მყოფი ბოლო ინდექსზე მდგომი ელემენტი არის "giorgi" მაშინ დაუპრინტე -->"you choose giorgi" , სხვა შემთხვევაში დაუპრინტე --> "you choose other name"```


# brb = ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "lasha" , "იამზე"]

# if brb [3] == "lasha":
#     print("you choose lasha") 
# elif brb [-1] == "გიორგი":
#     print("you choose გიორგი"  )
# else:
#     print("you choose other name")


#26)
# შექმენი ცვლადი სადაც შეინახავ პაროლს
# მომხმარებელს შემოატანინე პაროლი
# სანამ პირობა არის ჭეშმარიტი(True)
#       თუ მომხმარებლის პაროლი დაემთხვა შენს პაროლს:
#             დაპრინტე --> გამოიცანი
#              break
#       სხვა შემთხვევაში:
#           თავიდან გაუმეორე რომ შემოიყვანოს პაროლი

# my_pass ="123"
# user_pass =(input("enter your password"))
# while True:
#     if user_pass == my_pass:
#         print("guess")
#         break
#     else:
#         user_pass =(input("enter your password"))


#27)შექმენი ცვლადი და შეინახე სტრინგი --> "ჰიდროელექტროსადგური" , შენი დავალებაა რომ ტერმინალში გამოიტანო სადგური ,გამოიყენე slicing, ასევე კიდევ გამოიტანე ელექტროსადგური აქაც გამოიყენე სლაისინგი



#28)შექმენი ცვლადი და შეინახე სია --> ["გოგა" , "ირაკლი" , "საბა" , "გიორგი" , "ირმა" , "იამზე" , "სანი" , "თენგო" , "ლიზი" , "ნუცა" , "ქეთებვანი"] , შენი დავალებაა რომ ტერმინალში გამოიტანო ყველა სახელი საბადან სანიმდე,ასევე გამოიტანე სახელები გოგადან ირმა მდე გამოიყენე Slicing

#29)შექმენი სია სადაც შეინახავთ ინტეჯერებს,შენი დავალებაა შეამოწმო,თუ სიაში მყოფი მენულე ინდეწსზე მდგომი ელემენტი მეტია სიაში მყოფ ბოლო ინდექსზე მდგომ ელემენტზე და(and) ასევე სიის პირველი ელემენტი მეტია 0 ზე დაუპრინტე --> good , თუ სიის პირველი ელემენტი მეტია სიის ბოლო ელემენტზე და(and) სიის ნოლო ელემენტი ნაკლებია 0 ზე დაუპრინტე --> bad , სხვა შემთხვევაში დაუპრინტე -->"get out"

#30)შმომხმარებელს შემოატანინე ათწილადი,შემდეგ შეადარე,თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე მეტი და 30 ზე ნაკლები მაინ დაუპრინტე -->You entered number between 10 and 30, თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 10 ზე ნაკლები და 0 ზე მეტი მაშნ დაუპრინტე --> You choose number between 0 and 10 , თუ მომხმარებლის მიერ შემოტანილი რიცხვი არის 0 ზე ნაკლები მაშინ დაუპრინტე you choose negative number , სხვა შემთხვევაში დაუპრინტე -->you choose zero(0)



#31)შექმენი სია სადაც შეინახავ სტრინგებს(ადამიანის სახელებს,რაც გინდათ და რამდენიც გინდათ),შემდეგ შეადარეთ თუ ამ სიაში მყოფი მე0 ინდექსზე მდგომი ელემენტი არის 'luka' ან(or) არის "saba" დაუპრინტე -->You choose luka or saba, თუ ამ სიაში მყოფი ბოლო ინდექსზე მყოფი ელემენტი არის "irma" ან(or) "iamze" მაშინ დაუპრინტე --> You choose irma or iamze,სხვა შემთხვევაში დაუპტინტე --> You choose other name```






















