# Date Types --> integer ==>

#float -->თწილადი რიცხვი ==> 3.8,0.5

#boolean -->  ბულეანი არის True და False (გადაეცემა მხოლოდ ეს ორი მნიშვნელობა)

#string --> ნებისმიერი რამ რაც ბრჭყალებში გვაქვს მოცემული არის string ==> "luka"

#----------------------------------------------------------------------------------------------------

# input("enter your name") #გვეხმარება იმაში რომ მომხმარებლეს შემოვატანინოთ რაიმე სახის ინპორმაცია


#ცვლადი --> varisble 

# name = "irakli"


#------------------------------------------------------------------------------------------------------------------------

int() # გვეხმარება რომ სტრინგ რიცხვები გადავაქციოთ ინტეჯერებად --> ანყ სტრინგი გადაყავს ინტეჯერად

int("30") # ----> 30




str() # გვეხმარება რომ ინტეჯერ ტიპის მონაცემები გადავიყვანოთ სტრინგ ტიპში (ანუ ინტეჯერი გადაყავს სტრინგში)

str(10) # ----> "10"



float() # გვეხმარება რომ ინტეჯერ ტიპის მონაცემი გადავაქციოთ float ტიპის მონაცემად,ასევე float პუნქცია გვეხმარება იმაში რომ სტრინგი (რიცხვები)გადავაქციოთ float ში

float(10) # ---> 10.0

float("14.65") # ---> 14.65



#------------------------------------------------------------------------------------------------------------------------

bool() # True and False

bool("True")

#------------------------------------------------------------------------------------------------------------------------

print(type("12")) #int

print(type("goga")) #str




print(10 // 3) # --> 3

print(10 % 6) # --> 4

print(4 ** 3) # --> 64




#----------------------------------------------------------------------------------------------------

# for loop

# for i in range(10):
#     print("goga") # გამოიტანს "goga" ს 10 ჯერ




# for i in range(0,10,2): 
#     print(i)         # გამოიტანს რიცხვებს 0 დან 10 მდე




#while loop

# while True:
#     print("giorgi")


# i = 1
# while i<10:
#     print("giorgi")
#     i = i + 1




# aqedan = 0

# while aqedan<30:
#     print(aqedan)
#     aqedan = aqedan + 1















