#შედარების ოპერაციები(ოპერსტორები)

#> , < ,==  შედარების ოპერატორები

 
# print(10>5) #true იმიტომ რომ 10 მართ₾ მეტია 5-ზე

# print(15<3)#false იმიტომ ტომ 15 არ არის ნაკლები 3-ზე

# print(14 == 15 )#false იმიტომ რომ 14 არ უდრის 15

# print("giorgi" == "lasha") #false 




#მინიჭების ოპერატორი =

#-----------------------------------------------------------------------------------------------------------------

# num1 = int(input("enter first number : "))
# num2 = int(input("entet second number : "))

#------------------------------------------------------------------------------------------------------------------



ab1 = int(input("enter first number :"))
ab2 = int(input("enter second number : "))

print(ab1 > ab2)
print(ab1 == ab2)
print(ab1 < ab2 )



#-----------------------------------------------------------------------------------------------------------------

#logical operatosr - ლოგიკური ოპერაციები

#and და or 

#and ნიშნავს -> და 
#or ნიშნავს -> ან 


print(10 > 5 and  3 < 14) #true
print(10 > 5 and 60  < 14)#false



#------------------------------------------------------------------------------------------------------------------

