# and or 


# print(true and false)

# print(false and true)

# print(false and false)

# print(true and true)

# შედარების ოპერატორები >< ++

# print(5 > 10)

# print(10 < 100)

# print (50 == 51)


# print(40 == and 30 < 10 )   
# #      true and false

# print(50 > 10 or 40 == 31)
#     # true or false --> true


# ---------------------------------------------------------------------------------------------------------------

# (5 > 3  or 10 == 10) 

# (60 > 30 or 30 == 33)

# (30 == 30 or 4 < 10) 


# (30 > 10  or  100 < 5)

# ( 4 < 2 or 3 == 3 )

# (2 > 100 or 19 == 1)


#-----------------------------------------------------------------------------------------------------------------



# sequencing -თანმიმდევრობა
# selection -არჩევა
# iteration -გამეორება სანამ არ მიიღებს სწორ პასუხს.


#--------------------------------------------------------------------------------------------------------------

# for i in range(10):   #for ცილიკლი არის iteration ის მაგალითი(მეორდება რარაცა მოქმედება რამდენიმეჯელ)                      
#     print("goga")


for i in range(20):
     print("mari")

for i in range(10):
     print(i)

