#მათემატიკური ოპერატორები --> + : - : *: / .

# // --> ეს არის იგივე გაყოპის ნიშანი

print(5 * 3) # --> 15
print(5 * 3) # --> 15

print(5 * "goga")

print(5 * 3) # --> 15

print(5 * 3) # --> 15



print(10 % 6) #ეს გვიბრუნებს თუ რამდენი ნაშთი დაგვრჩა --> 4

print(10 % 5) # --> 0



#სულ ვისწავლეთ 3 მათემატიკური ოპერატორები ესენია: // : % : ** .


# print(10 % 6) ეს გვიბრუნებს თუ რამდენი ნაშთი დაგვრჩა როდესაც ერთი რიცხვი გავყავით მეორეზე.
# შემდეგი ვისწავლეთ ** ეს იმით განსხვავდება * რომ მაგ:print(5 * 3) # --> 15 print(5 * 3) # --> 15
#ბოლო კი // print(5 * 3) # --> 15  print(5 * 3) # --> 15



























